Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
        if (local.is_valid == 1) {
            int t_i = (int)local.temp, t_d = (int)((local.temp - t_i) * 10 + 0.5f);
            int h_i = (int)local.humi, h_d = (int)((local.humi - h_i) * 10 + 0.5f);
            if (t_d >= 10) { t_i++; t_d -= 10; }
            if (h_d >= 10) { h_i++; h_d -= 10; }
            snprintf(line1, sizeof(line1), "T:%d.%dC H:%d.%d%%", t_i, t_d, h_i, h_d);
        } else if (local.is_valid == 0) {
            snprintf(line1, sizeof(line1), "reading...");
        } else {
            snprintf(line1, sizeof(line1), "DHT11 fault!");
        }
        snprintf(line2, sizeof(line2), "Light: %u", local.light);
        snprintf(line3, sizeof(line3), "Dist: %u cm", local.distance);

        rt_mutex_take(&i2c_mutex, RT_WAITING_FOREVER);
        ssd1306_Fill(Black);
        ssd1306_SetCursor(0, 0);
        ssd1306_WriteString(line1, Font_7x10, White);
        ssd1306_SetCursor(0, 16);
        ssd1306_WriteString(line2, Font_7x10, White);
        ssd1306_SetCursor(0, 32);
        ssd1306_WriteString(line3, Font_7x10, White);
        ssd1306_UpdateScreen(&hi2c1);
        rt_mutex_release(&i2c_mutex);
    }
}

/* ---- Shell Thread (UART command parser with history + autocomplete) ------ */

#define HIST_SIZE  8
#define HIST_LEN   32
#define CMD_BUF    32

static const char *shell_cmds[] = {
    "help", "temp", "humi", "light", "dist", "stat",
    "led on", "led off", "snake", NULL
};

static void shell_thread_entry(void *param)
{
    static char cmd[CMD_BUF], history[HIST_SIZE][HIST_LEN];
    static int  hist_wr, hist_cnt, hist_cur;
    static uint8_t pos, esc_state;
    char buf[64];

    uart_puts("\r\n \\ | /\r\n");
    uart_puts("- RT -     Thread Operating System\r\n");
    snprintf(buf, sizeof(buf), " / | \\     %d.%d.%d build %s %s\r\n",
             RT_VERSION, RT_SUBVERSION, RT_REVISION, __DATE__, __TIME__);
    uart_puts(buf);
    uart_puts(" 2006 - 2022 Copyright by RT-Thread team\r\n\r\n");
    uart_puts("rtt> ");

    while (1) {
        /* yield UART to game thread during serial snake */
        if (game_mode == 1 && g_serial_snake) {
            rt_thread_mdelay(50);
            continue;
        }

        int c = uart_getc();
        if (c < 0) { rt_thread_mdelay(10); continue; }

        /* ---- ESC sequence parser (arrow keys) ---- */
        if (esc_state == 0 && c == 0x1B)      { esc_state = 1; continue; }
        if (esc_state == 1) {
            esc_state = (c == '[') ? 2 : 0;
            continue;
        }
        if (esc_state == 2) {
            esc_state = 0;

            if (c == 'A') {     /* UP: browse older history */
                if (hist_cnt == 0) continue;
                if (hist_cur < hist_cnt) {
                    /* save current input if at bottom */
                    if (hist_cur == 0) memcpy(history[hist_wr], cmd, pos + 1);

                    hist_cur++;
                    int idx = (hist_wr - hist_cur + HIST_SIZE) % HIST_SIZE;
                    /* clear line, show recalled command */
                    while (pos--) uart_puts("\b \b");
                    uart_puts(history[idx]);
                    strcpy(cmd, history[idx]);
                    pos = strlen(cmd);
                }
                continue;
            }
            if (c == 'B') {     /* DOWN: browse newer history */
                if (hist_cur == 0) continue;
                hist_cur--;
                /* clear line */
                while (pos--) uart_puts("\b \b");
                if (hist_cur == 0) {
                    cmd[0] = '\0'; pos = 0; /* bottom: restore current input */
                    memcpy(cmd, history[hist_wr], HIST_LEN);
                    cmd[HIST_LEN-1] = '\0';
                    pos = strlen(cmd);
                    uart_puts(cmd);
                } else {
                    int idx = (hist_wr - hist_cur + HIST_SIZE) % HIST_SIZE;
                    uart_puts(history[idx]);
                    strcpy(cmd, history[idx]);
                    pos = strlen(cmd);
                }
                continue;
            }
            /* other CSI keys: ignore */
            continue;
        }

        /* ---- Backspace ---- */
        if (c == '\b' || c == 127) {
            if (pos > 0) { uart_puts("\b \b"); pos--; cmd[pos] = '\0'; }
            continue;
        }

        /* ---- Tab: autocomplete ---- */
        if (c == '\t') {
            int match_idx = -1, match_cnt = 0;
            for (int i = 0; shell_cmds[i]; i++) {
                if (!strncmp(shell_cmds[i], cmd, pos)) {
                    match_idx = i;
                    match_cnt++;
                }
            }
            if (match_cnt == 1) {
                /* unique match: complete */
                while (pos--) uart_puts("\b \b");
                uart_puts(shell_cmds[match_idx]);
                strcpy(cmd, shell_cmds[match_idx]);
                pos = strlen(cmd);
            } else if (match_cnt > 1) {
                /* multiple: list them */
                uart_puts("\r\n");
                for (int i = 0; shell_cmds[i]; i++)
                    if (!strncmp(shell_cmds[i], cmd, pos)) {
                        uart_puts(shell_cmds[i]);
                        uart_puts("  ");
                    }
                uart_puts("\r\nrtt> ");
                uart_puts(cmd);
            }
            continue;
        }

        /* ---- Echo printable ---- */
        uart_putc((char)c);

        /* ---- Enter: execute ---- */
        if (c == '\r' || c == '\n') {
            cmd[pos] = '\0';
            uart_puts("\r\n");

            if (pos == 0) goto prompt;

            /* save to history (skip duplicates) */
            if (hist_cnt == 0 || strcmp(cmd, history[(hist_wr - 1 + HIST_SIZE) % HIST_SIZE])) {
                strncpy(history[hist_wr], cmd, HIST_LEN - 1);
                history[hist_wr][HIST_LEN - 1] = '\0';
                hist_wr = (hist_wr + 1) % HIST_SIZE;
                if (hist_cnt < HIST_SIZE) hist_cnt++;
            }
            hist_cur = 0;

            /* ---- command dispatch ---- */
            if      (!strcmp(cmd, "help")) uart_puts("help temp humi light dist stat led on|off snake\r\nwifi SSID PWD   mqtt IP PORT ID   connect   mqttconn\r\npub   sub TOPIC   unsub TOPIC\r\n");
            else if (!strcmp(cmd, "stat")) {
                rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
                struct SensorData local = sensor_data;
                rt_mutex_release(&sensor_mutex);
                char buf[64];
                int ti = (int)local.temp, td = (int)((local.temp - ti) * 10 + 0.5f);
                int hi = (int)local.humi, hd = (int)((local.humi - hi) * 10 + 0.5f);
                snprintf(buf, sizeof(buf), "T:%d.%dC H:%d.%d%% Light:%u Dist:%ucm ok:%d esp:%d\r\n",
                         ti, td, hi, hd, local.light, local.distance, local.is_valid, mqtt_connected);
                uart_puts(buf);
            }
            else if (!strcmp(cmd, "temp")) {
                rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
                float t = sensor_data.temp;
                rt_mutex_release(&sensor_mutex);
                char buf[16];
                int ti = (int)t, td = (int)((t - ti) * 10 + 0.5f);
                snprintf(buf, sizeof(buf), "%d.%d C\r\n", ti, td); uart_puts(buf);
            }
            else if (!strcmp(cmd, "humi")) {
                rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
                float h = sensor_data.humi;
                rt_mutex_release(&sensor_mutex);
                char buf[16];
                int hi = (int)h, hd = (int)((h - hi) * 10 + 0.5f);
                snprintf(buf, sizeof(buf), "%d.%d %%\r\n", hi, hd); uart_puts(buf);
            }
            else if (!strcmp(cmd, "light")) {
                rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
                uint16_t l = sensor_data.light;
                rt_mutex_release(&sensor_mutex);
                char buf[16]; snprintf(buf, sizeof(buf), "%u\r\n", l); uart_puts(buf);
            }
            else if (!strcmp(cmd, "dist")) {
                rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
                uint16_t d = sensor_data.distance;
                rt_mutex_release(&sensor_mutex);
                char buf[16]; snprintf(buf, sizeof(buf), "%u cm\r\n", d); uart_puts(buf);
            }
            else if (!strcmp(cmd, "led on"))  { auto_mode = 1; cur_led = 0; all_leds_off(); uart_puts("ok\r\n"); }
            else if (!strcmp(cmd, "led off")) { auto_mode = 0; cur_led = 0; all_leds_off(); uart_puts("ok\r\n"); }
            else if (!strcmp(cmd, "snake"))  { snake_init(); game_mode = 1; g_serial_snake = 1; uart_puts("WASD=move Enter=end Ctrl+C=abort\r\n"); }
            else if (!strncmp(cmd, "wifi ", 5)) {
                char *sp = strchr(cmd + 5, ' ');
                if (!sp) { uart_puts("usage: wifi SSID PWD\r\n"); goto prompt; }
                *sp = '\0';
                strncpy(mqtt_ssid, cmd + 5, sizeof(mqtt_ssid) - 1);
                strncpy(mqtt_pwd, sp + 1, sizeof(mqtt_pwd) - 1);
                uart_puts("saved\r\n");
            }
            else if (!strcmp(cmd, "connect")) {
                uart_puts("Connecting WiFi...\r\n");
                esp_cmd = 1;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 25000) == RT_EOK) {
                    if (esp_result == 0) uart_puts("WiFi connected!\r\n");
                    else { char b[48]; snprintf(b, sizeof(b), "WiFi fail %d\r\n", (int)esp_result); uart_puts(b); }
                } else uart_puts("WiFi timeout\r\n");
            }
            else if (!strncmp(cmd, "mqtt ", 5)) {
                char *p1 = strchr(cmd + 5, ' ');
                char *p2 = p1 ? strchr(p1 + 1, ' ') : NULL;
                if (!p1 || !p2) { uart_puts("usage: mqtt IP PORT ID\r\n"); goto prompt; }
                *p1 = '\0'; *p2 = '\0';
                strncpy(mqtt_broker, cmd + 5, sizeof(mqtt_broker) - 1);
                strncpy(mqtt_port,   p1 + 1, sizeof(mqtt_port) - 1);
                strncpy(mqtt_client, p2 + 1, sizeof(mqtt_client) - 1);
                uart_puts("saved\r\n");
            }
            else if (!strcmp(cmd, "mqttconn")) {
                uart_puts("Connecting MQTT...\r\n");
                esp_cmd = 2;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 15000) == RT_EOK) {
                    if (esp_result == 0) uart_puts("MQTT connected!\r\n");
                    else { char b[48]; snprintf(b, sizeof(b), "MQTT fail %d\r\n", (int)esp_result); uart_puts(b); }
                } else uart_puts("MQTT timeout\r\n");
            }
            else if (!strcmp(cmd, "pub")) {
                esp_cmd = 3;
                rt_sem_release(&esp_go_sem);
                rt_sem_take(&esp_done_sem, 10000);
                uart_puts(esp_result == 0 ? "pub ok\r\n" : "pub fail\r\n");
            }
            else if (!strncmp(cmd, "test ", 5)) {
                esp_cmd = 7;
                strncpy(mqtt_topic, cmd + 5, sizeof(mqtt_topic) - 1);
                rt_sem_release(&esp_go_sem);
                rt_sem_take(&esp_done_sem, 10000);
                uart_puts(esp_result == 0 ? "test ok\r\n" : "test fail\r\n");
            }
            else if (!strncmp(cmd, "sub ", 4)) {
                strncpy(mqtt_topic, cmd + 4, sizeof(mqtt_topic) - 1);
                esp_cmd = 4;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 10000) == RT_EOK) {
                    if (esp_result == 0) uart_puts("sub ok\r\n");
                    else { char b[32]; snprintf(b, sizeof(b), "sub fail %d\r\n", (int)esp_result); uart_puts(b); }
                } else uart_puts("sub timeout\r\n");
            }
            else if (!strncmp(cmd, "unsub ", 6)) {
                strncpy(mqtt_topic, cmd + 6, sizeof(mqtt_topic) - 1);
                esp_cmd = 5;
                rt_sem_release(&esp_go_sem);
                if (rt_sem_take(&esp_done_sem, 10000) == RT_EOK) {
                    if (esp_result == 0) uart_puts("unsub ok\r\n");
                    else { char b[32]; snprintf(b, sizeof(b), "unsub fail %d\r\n", (int)esp_result); uart_puts(b); }
                } else uart_puts("unsub timeout\r\n");
            }
            else { uart_puts("? try: help\r\n"); }

prompt:
            pos = 0;
            uart_puts("rtt> ");
        } else if (pos < CMD_BUF - 1) {
            cmd[pos++] = (char)c;
            cmd[pos] = '\0';
        }
    }
}

/* ---- ESP Thread (async WiFi/MQTT worker) --------------------------------- */

static void esp_thread_entry(void *param)
{
    while (1) {
        rt_err_t ret = rt_sem_take(&esp_go_sem, mqtt_connected == 2 ? 800 : RT_WAITING_FOREVER);
        if (ret != RT_EOK && mqtt_connected == 2) esp_cmd = 6;

        int cmd = esp_cmd;

