Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
        if (cmd == 1) {
            esp_result = ESP8266_Init();
            if (esp_result >= 0) {
                rt_thread_mdelay(2000);
                esp_result = ESP8266_JoinAccessPoint(mqtt_ssid, mqtt_pwd);
            }
            mqtt_connected = (esp_result == 0) ? 1 : -1;
        }
        else if (cmd == 2) {
            esp_result = ESP8266_ConnectToServer(mqtt_broker, mqtt_port);
            if (esp_result >= 0)
                esp_result = ESP8266_MqttUserCfg(mqtt_client, "", "");
            if (esp_result >= 0)
                esp_result = ESP8266_MqttConnect(0, mqtt_broker, mqtt_port, 0);
            mqtt_connected = (esp_result == 0) ? 2 : -2;
        }
        else if (cmd == 3) {
            rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
            struct SensorData local = sensor_data;
            rt_mutex_release(&sensor_mutex);
            char payload[128];
            int t_i = (int)local.temp, t_d = (int)((local.temp - t_i) * 10 + 0.5f);
            int h_i = (int)local.humi, h_d = (int)((local.humi - h_i) * 10 + 0.5f);
            if (t_d >= 10) { t_i++; t_d -= 10; }
            if (h_d >= 10) { h_i++; h_d -= 10; }
            snprintf(payload, sizeof(payload),
                "t=%d.%d h=%d.%d l=%u d=%u",
                t_i, t_d, h_i, h_d, local.light, local.distance);
            uart_puts("\r\n[pub] ");
            uart_puts(payload);
            uart_puts("\r\n");
            esp_result = ESP8266_MqttPub("sensor/data", (uint8_t*)payload, strlen(payload));
        }
        else if (cmd == 4) {
            esp_result = ESP8266_MqttSub(0, mqtt_topic, 0);
        }
        else if (cmd == 5) {
            esp_result = ESP8266_MqttUnsub(0, mqtt_topic);
        }
        else if (cmd == 7) {
            esp_result = ESP8266_MqttPub(mqtt_topic, (uint8_t*)"hello", 5);
        }
        else if (cmd == 6) {
            /* background: scan for +MQTTSUBRECV and auto-print */
            const char *b = esp_get_buf();
            int len = esp_get_buf_len();
            if (len > 0) {
                char *p = strstr((char*)b, "+MQTTSUBRECV");
                if (p) {
                    char *eol = strpbrk(p, "\r\n");
                    if (eol) {
                        *eol = '\0';
                        char *last = strrchr(p, ',');
                        if (last) {
                            uart_puts("\r\n[MQTT] ");
                            uart_puts(last + 1);
                            uart_puts("\r\nrtt> ");
                        }
                    }
                    esp_clear_buf();
                }
            }
            continue;  /* don't release done_sem for background check */
        }

        rt_sem_release(&esp_done_sem);
    }
}

/* ---- Game Thread (snake on MAX7219) -------------------------------------- */

static void game_thread_entry(void *param)
{
    const uint8_t smiley[8] = {
        0x00, 0x24, 0x24, 0x00, 0x00, 0x42, 0x3C, 0x00
    };
    static int prev_mode = 1;  /* force initial smiley display on boot */

    while (1) {
        if (!game_mode) {
            if (prev_mode) { max7219_display(smiley); prev_mode = 0; }
            rt_thread_mdelay(100);
            continue;
        }
        prev_mode = game_mode;

        if (game_mode == 1) {
            /* serial input: poll for WASD / arrows / Ctrl+C / Enter */
            if (g_serial_snake) {
                int c;
                while ((c = uart_getc()) >= 0) {
                    if (c == 0x03)      { game_mode = 0; break; }       /* Ctrl+C */
                    if (c == '\r' || c == '\n') { game_mode = 0; break; }
                    if (c == 'w' || c == 'W') g_dir = DIR_UP;
                    if (c == 's' || c == 'S') g_dir = DIR_DOWN;
                    if (c == 'a' || c == 'A') g_dir = DIR_LEFT;
                    if (c == 'd' || c == 'D') g_dir = DIR_RIGHT;
                }
                if (!game_mode) { g_serial_snake = 0; continue; }
            }

            snake_tick(g_dir);
            g_dir = DIR_NONE;

            uint8_t rows[8];
            snake_get_display(rows);
            max7219_display(rows);

            if (snake_is_dead()) game_mode = 2;
            rt_thread_mdelay(snake_get_speed_ms());
            continue;
        }

        if (game_mode == 2) {
            const uint8_t all[8]  = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
            const uint8_t none[8] = {0,0,0,0,0,0,0,0};
            int i;
            for (i = 0; i < 3 && game_mode == 2; i++) {
                max7219_display(all);  rt_thread_mdelay(150);
                if (game_mode != 2) break;
                max7219_display(none); rt_thread_mdelay(150);
            }
            if (i >= 3) game_mode = 0;  /* auto-exit after 3 blinks */
            continue;
        }
    }
}

/* ---- Application Entry --------------------------------------------------- */
int main(void)
{
    MX_GPIO_Init();
    MX_I2C1_Init();
    ssd1306_Init(&hi2c1);
    MX_ADC1_Init();
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    max7219_init();

    /* SR04 Trig pin (PB6): output push-pull */
    {
        GPIO_InitTypeDef s = {0};
        s.Pin   = TRIG_Pin;
        s.Mode  = GPIO_MODE_OUTPUT_PP;
        s.Pull  = GPIO_NOPULL;
        s.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(TRIG_GPIO_Port, &s);
        HAL_GPIO_WritePin(TRIG_GPIO_Port, TRIG_Pin, GPIO_PIN_RESET);
    }

    MX_TIM4_Init();
    HAL_TIM_Base_Start_IT(&htim4);             /* start timer counter */
    HAL_TIM_IC_Start_IT(&htim4, TIM_CHANNEL_2);
    __HAL_TIM_ENABLE_IT(&htim4, TIM_IT_UPDATE);  /* overflow interrupt */

    /* kernel objects (static init — no heap frag) */
    rt_mutex_init(&sensor_mutex, "s_mtx", RT_IPC_FLAG_FIFO);
    rt_mutex_init(&i2c_mutex,    "i_mtx", RT_IPC_FLAG_FIFO);
    rt_sem_init(&sensor_sem, "s_sem", 0, RT_IPC_FLAG_FIFO);
    rt_sem_init(&key_sem,    "k_sem", 0, RT_IPC_FLAG_FIFO);
    rt_sem_init(&esp_go_sem, "e_go",  0, RT_IPC_FLAG_FIFO);
    rt_sem_init(&esp_done_sem,"e_done",0, RT_IPC_FLAG_FIFO);

    /* splash screen */
    ssd1306_Fill(Black);
    /* border */
    for (uint8_t x = 0; x < 128; x++) {
        ssd1306_DrawPixel(x,  0, White);
        ssd1306_DrawPixel(x, 63, White);
    }
    for (uint8_t y = 0; y < 64; y++) {
        ssd1306_DrawPixel(0,   y, White);
        ssd1306_DrawPixel(127, y, White);
    }
    /* title */
    ssd1306_SetCursor(20, 12);
    ssd1306_WriteString("RT-Thread", Font_11x18, White);
    ssd1306_SetCursor(30, 36);
    ssd1306_WriteString("Nano v3.1", Font_7x10, White);
    ssd1306_UpdateScreen(&hi2c1);
    rt_thread_mdelay(1500);
    ssd1306_Fill(Black);
    ssd1306_SetCursor(22, 20);
    ssd1306_WriteString("Init...", Font_11x18, White);
    ssd1306_UpdateScreen(&hi2c1);

    rt_thread_t tid;
    tid = rt_thread_create("sens", sensor_thread_entry, RT_NULL, 768,  8, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("oled", oled_thread_entry,   RT_NULL, 1024, 12, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("led",  led_thread_entry,    RT_NULL, 512,  11, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("keys", key_thread_entry,    RT_NULL, 384,  10, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("shell", shell_thread_entry,  RT_NULL, 1024, 13, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("esp",   esp_thread_entry,    RT_NULL, 1024, 14, 10);
    if (tid) rt_thread_startup(tid);
    tid = rt_thread_create("game",  game_thread_entry,   RT_NULL, 640,   9, 10);
    if (tid) rt_thread_startup(tid);

    while (1) rt_thread_mdelay(1000);
    return RT_EOK;
}

/* ---- System Clock Configuration (called from board.c) ------------------- */

void SystemClock_Config(void)
{
    RCC_OscInitTypeDef RCC_OscInitStruct = {0};
    RCC_ClkInitTypeDef RCC_ClkInitStruct = {0};

    RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
    RCC_OscInitStruct.HSEState = RCC_HSE_ON;
    RCC_OscInitStruct.HSEPredivValue = RCC_HSE_PREDIV_DIV1;
    RCC_OscInitStruct.HSIState = RCC_HSI_ON;
    RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
    RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
    RCC_OscInitStruct.PLL.PLLMUL = RCC_PLL_MUL9;
    if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
        Error_Handler();

    RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
                                  |RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
    RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
    RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
    RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV2;
    RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV1;

    if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_2) != HAL_OK)
        Error_Handler();
}

void Error_Handler(void)
{
    __disable_irq();
    while (1) {}
}
